code/openfoam/tutorials/incompressibleFluid/oscillatingInlet/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        inletChannel;

    solidBodyMotionFunction
    {
        type            oscillatingLinearMotion;

        amplitude       (0 0.5 0);
        omega           3.14; // rad/s  (.5 rps)
    }
}


// ************************************************************************* //
